import { LocalizationSchema, PrepareSchema } from "./schema";

const schema: PrepareSchema<LocalizationSchema, "" | "_plural"> = {
    "lang": "uk",
    "common": {
        "and": "і",
        "accept": "Прийняти",
        "start": "Почати",
        "continue": "Продовжити",
        "continueAnyway": "Продовжити все одно",
        "back": "Назад",
        "logout": "Вийти",
        "logoutFrom": "Вийти з {{name}}",
        "cancel": "Скасувати",
        "balance": "Баланс",
        "totalBalance": "Загальний баланс",
        "walletAddress": "Адреса гаманця",
        "recipientAddress": "Адреса отримувача",
        "recipient": "Отримувач",
        "copy": "Копіювати",
        "copiedAlert": "Скопійовано в буфер обміну",
        "copied": "Скопійовано",
        "share": "Поділитися",
        "send": "Надіслати",
        "yes": "Так",
        "no": "Ні",
        "amount": "Сума",
        "today": "Сьогодні",
        "yesterday": "Вчора",
        "comment": "Коментар",
        "products": "Продукти",
        "confirm": "Підтвердити",
        "soon": "скоро",
        "in": "в",
        "max": "Макс",
        "close": "Закрити",
        "delete": "Видалити",
        "apply": "Застосувати",
        "domainOrAddress": "Адреса гаманця або домен",
        "domainOrAddressOrContact": "Адреса, домен або ім'я",
        "domain": "Домен",
        "search": "Пошук",
        "termsOfService": "Умови\u00A0обслуговування",
        "privacyPolicy": "Політика\u00A0конфіденційності",
        "apy": "APY",
        "tx": "Транзакція",
        "add": "Додати",
        "connect": "Підключити",
        "gotIt": "Зрозуміло",
        "error": "Помилка",
        "wallet": "Гаманець",
        "wallets": "Гаманці",
        "cards": "Картки",
        "later": "Пізніше",
        "select": "Вибрати",
        "show": "Показати",
        "hide": "Сховати",
        "showAll": "Показати все",
        "hideAll": "Сховати все",
        "done": "Готово",
        "mainWallet": "Основний гаманець",
        "walletName": "Назва гаманця",
        "from": "Від",
        "to": "До",
        "transaction": "Транзакція",
        "somethingWentWrong": "Щось пішло не так",
        "checkInternetConnection": "Перевірте підключення до інтернету",
        "reload": "Перезавантажити",
        "errorOccurred": "Виникла помилка: {{error}}",
        "recent": "Останні",
        "ok": "OK",
        "attention": "Увага",
        "save": "Зберегти",
        "assets": "Активи",
        "message": "Повідомлення",
        "messages": "Повідомлення",
        "airdrop": "Airdrop",
        "myWallets": "Мої гаманці",
        "showMore": "Показати більше",
        "balances": "Баланс",
        "loading": "Завантаження...",
        "notFound": "Не знайдено",
        "unverified": "Неперевірено",
        "addressBook": "Адресна книга",
        "gasless": "Без газу",
        "address": "Адреса",
        "poolAddress": "Адреса пулу",
        "currencyChanged": "Валюта змінена",
        "required": "обов'язково",
        "operation": "Операція",
        "description": "Опис",
        "openSettings": "Відкрити налаштування",
        "exchanges": "Біржі",
        "directDepositAddress": "Адреса прямого поповнення"
    },
    "syncStatus": {
        "connecting": "Підключення",
        "updating": "Оновлення",
        "online": "Підключено"
    },
    "home": {
        "home": "Головна",
        "history": "Історія",
        "browser": "Браузер",
        "settings": "Налаштування"
    },
    "settings": {
        "title": "Більше",
        "backupKeys": "Резервні ключі",
        "holdersAccounts": "Рахунки для витрат",
        "migrateOldWallets": "Міграція старих гаманців",
        "termsOfService": "Умови обслуговування",
        "privacyPolicy": "Політика конфіденційності",
        "developerTools": "Інструменти розробника",
        "spamFilter": "Фільтр СПАМу",
        "primaryCurrency": "Основна валюта",
        "experimental": "Експериментальний",
        "support": {
            "title": "Підтримка",
            "telegram": "Telegram",
            "form": "Форма підтримки",
            "holders": "Банківська картка та рахунки",
            "tonhub": "Tonhub"
        },
        "telegram": "Підпишіться на наш Telegram",
        "rateApp": "Оцінити додаток",
        "deleteAccount": "Видалити акаунт",
        "theme": "Тема",
        "searchEngine": "Пошукова система",
        "deleteWallet": "Видалити гаманець",
        "deleteWalletWithName": "Видалити гаманець \"{{name}}\"",
        "disconnectWallet": "Відключити гаманець",
        "disconnectWalletWithName": "Відключити гаманець \"{{name}}\"",
        "language": "Мова"
    },
    "walletImportSelector": {
        "description": "Введіть вашу сід фразу або підключіть Ledger",
        "title": "Додавання гаманця",
        "seed": "Ввести секретні слова"
    },
    "ledgerOnboarding": {
        "title": "Налаштуйте додаток",
        "description": "Ми створимо окремий гаманець для налаштування безпеки, перед підключенням Ledger",
        "button": "Створити гаманець"
    },
    "theme": {
        "title": "Тема",
        "light": "Світла",
        "dark": "Темна",
        "system": "Системна"
    },
    "wallet": {
        "sync": "Завантаження даних гаманця",
        "balanceTitle": "Баланс TON",
        "owner": "Власник",
        "mainAccount": "Основний акаунт",
        "actions": {
            "receive": "Отримати",
            "send": "Надіслати",
            "buy": "Купити",
            "swap": "Обміняти",
            "deposit": "Депозит",
            "payments": "Платежі",
            "scan": "Сканувати"
        },
        "empty": {
            "message": "У вас немає транзакцій",
            "receive": "Отримати TON",
            "description": "Здійсніть свою першу транзакцію"
        },
        "pendingTransactions": "Очікувані транзакції"
    },
    "transactions": {
        "title": "Транзакції",
        "history": "Історія",
        "filter": {
            "holders": "Картки",
            "ton": "Транзакції гаманця",
            "any": "Усі",
            "type": "Тип",
            "accounts": "Витрати"
        }
    },
    "tx": {
        "sending": "Надсилання",
        "sent": "Надіслано",
        "received": "Отримано",
        "bounced": "Відхилено",
        "tokenTransfer": "Передача токенів",
        "airdrop": "Airdrop",
        "failed": "Не вдалося",
        "timeout": "Час вийшов",
        "batch": "Пакет"
    },
    "txPreview": {
        "sendAgain": "Надіслати знову",
        "blockchainFee": "Комісія мережі",
        "blockchainFeeDescription": "Ця комісія також називається GAS. Вона необхідна для успішної обробки транзакції в блокчейні. Розмір GAS залежить від обсягу роботи, яку мають виконати валідатори для включення транзакції в блок."
    },
    "receive": {
        "title": "Отримати",
        "subtitleTon": "Надсилайте лише Toncoin та токени в мережі TON на цю адресу, інакше ви можете втратити свої кошти.",
        "subtitleSolana": "Надсилайте лише SOL та SPL токени в мережі Solana на цю адресу, інакше ви можете втратити свої кошти.",
        "share": {
            "title": "Моя адреса Tonhub",
            "error": "Не вдалося поділитися адресою, спробуйте ще раз або зверніться до підтримки"
        },
        "holdersJettonWarning": "Надсилайте на цю адресу тільки {{symbol}}, якщо ви надішлете інший токен, ви його втратите.",
        "assets": "Токени та рахунки",
        "fromExchange": "З біржі",
        "otherCoins": "Інші токени",
        "deposit": "Поповнити на"
    },
    "transfer": {
        "title": "Надіслати",
        "titleAction": "Дія",
        "confirm": "Ви впевнені, що хочете продовжити?",
        "error": {
            "invalidAddress": "Неправильна адреса",
            "invalidAddressMessage": "Будь ласка, перевірте адресу отримувача",
            "invalidAmount": "Неправильна сума",
            "invalidDomain": "Неправильний домен",
            "invalidDomainString": "Мінімум 4 символи, максимум 126 символів. Допускаються латинські літери (a-z), цифри (0-9) та дефіс (-). Дефіс не може бути на початку або в кінці.",
            "sendingToYourself": "Ви не можете надіслати монети самому собі",
            "zeroCoins": "На жаль, ви не можете надіслати 0",
            "zeroCoinsAlert": "Ви намагаєтеся надіслати 0",
            "notEnoughCoins": "У вас недостатньо коштів на балансі",
            "addressIsForTestnet": "Ця адреса для тестової мережі",
            "addressCantReceive": "Ця адреса не може отримувати монети",
            "addressIsNotActive": "Історія гаманця відсутня",
            "addressIsNotActiveDescription": "Це означає, що з цієї адреси гаманця не було здійснено жодних транзакцій",
            "invalidTransaction": "Неправильна транзакція",
            "invalidTransactionMessage": "Будь ласка, перевірте деталі транзакції",
            "memoRequired": "Додайте мему/тег, щоб уникнути втрати коштів",
            "holdersMemoRequired": "Тег/MEMO",
            "memoChange": "Змініть мему/тег на \"{{memo}}\"",
            "gaslessFailed": "Не вдалося надіслати транзакцію",
            "gaslessFailedMessage": "Будь ласка, спробуйте ще раз або зверніться до підтримки",
            "gaslessFailedEstimate": "Не вдалося оцінити комісію, спробуйте пізніше або зверніться до підтримки",
            "gaslessCooldown": "Ви можете сплачувати комісію за газ у валюті токена лише раз на кілька хвилин. Будь ласка, зачекайте або сплатіть комісію за транзакцію в TON.",
            "gaslessCooldownTitle": "Зачекайте кілька хвилин перед наступною транзакцією",
            "gaslessCooldownWait": "Я зачекаю",
            "gaslessCooldownPayTon": "Сплатити газ у TON",
            "gaslessNotEnoughFunds": "Недостатньо коштів",
            "gaslessNotEnoughFundsMessage": "Сума безгазової передачі з комісією перевищує ваш баланс, спробуйте надіслати меншу суму або зверніться до підтримки",
            "gaslessTryLater": "Спробуйте пізніше",
            "gaslessTryLaterMessage": "Ви можете спробувати пізніше або звернутися до підтримки",
            "gaslessNotEnoughCoins": "{{fee}} комісії необхідно для надсилання, не вистачає {{missing}}",
            "notEnoughJettons": "Недостатньо {{symbol}}",
            "jettonChange": "Отримувач підтримує лише перекази {{symbol}}, будь ласка, змініть отримувача або валюту переказу",
            "ledgerErrorConnectionTitle": "Ledger не підключений",
            "ledgerErrorConnectionMessage": "Будь ласка, підключіть Ledger та повторіть спробу",
            "notEnoughGasTitle": "Недостатньо TON для оплати комісії за газ",
            "notEnoughGasMessage": "Будь ласка, поповніть гаманець TON (потрібно щонайменше {{diff}} TON) і спробуйте ще раз"
        },
        "changeJetton": "Переключитися на {{symbol}}",
        "sendAll": "Макс",
        "scanQR": "сканувати qr код",
        "sendTo": "Надіслати до",
        "fee": "Комісія мережі: {{fee}}",
        "feeEmpty": "Комісії будуть розраховані пізніше",
        "feeTitle": "Комісії мережі",
        "feeTotalTitle": "Загальні комісії мережі",
        "purpose": "Мета транзакції",
        "comment": "Повідомлення (необов'язково)",
        "commentDescription": "Повідомлення буде видно всім у блокчейні",
        "commentRequired": "Перевірте свою мему/тег перед надсиланням",
        "commentLabel": "Повідомлення",
        "checkComment": "Перевірте перед надсиланням",
        "confirmTitle": "Підтвердити транзакцію",
        "confirmManyTitle": "Підтвердити {{count}} транзакцій",
        "unknown": "Невідома операція",
        "moreDetails": "Більше деталей",
        "gasFee": "Комісія за газ",
        "contact": "Ваш контакт",
        "firstTime": "Надсилання вперше",
        "requestsToSign": "{{app}} запитує підпис",
        "smartContract": "Операція смарт-контракту",
        "txsSummary": "Загалом",
        "txsTotal": "Загальна сума",
        "gasDetails": "Деталі газу",
        "jettonGas": "Газ для надсилання токенів",
        "unusualJettonsGas": "Газ вищий за звичайний",
        "unusualJettonsGasTitle": "Комісія за надсилання токенів становить {{amount}} TON",
        "unusualJettonsGasMessage": "Комісія за транзакцію токенів (Газ) вища за звичайну",
        "addressNotActive": "Цей гаманець не мав вихідних транзакцій",
        "wrongJettonTitle": "Неправильний токен",
        "wrongJettonMessage": "Ви намагаєтеся надіслати токен, якого у вас немає",
        "notEnoughJettonsTitle": "Недостатньо токенів",
        "notEnoughJettonsMessage": "Ви намагаєтеся надіслати більше токенів, ніж у вас є",
        "aboutFees": "Про комісії",
        "aboutFeesDescription": "Комісії за транзакції в блокчейні залежать від кількох факторів, таких як завантаженість мережі, розмір транзакції, ціна газу та параметри конфігурації блокчейну. Чим вищий попит на обробку транзакцій у блокчейні або чим більший розмір транзакції (повідомлення/коментар), тим вищі будуть комісії.",
        "gaslessTransferSwitch": "Сплатити комісію за газ у {{symbol}}",
        "solana": {
            "error": {
                "title": "Помилка транзакції Solana",
                "networkRequestFailed": "Помилка мережі, спробуйте пізніше або зверніться до підтримки",
                "connectionTimeout": "Час очікування з\'єднання вичерпано, спробуйте пізніше або зверніться до підтримки",
                "connectionRefused": "З\'єднання відхилено, спробуйте пізніше або зверніться до підтримки",
                "connectionReset": "З\'єднання скинуто, спробуйте пізніше або зверніться до підтримки",
                "insufficientLamports": "Недостатньо SOL",
                "insufficientLamportsWithAmount": "Недостатньо SOL, потрібно ще {{amount}}",
                "insufficientTokenFunds": "Недостатньо токенів",
                "rateLimited": "Спостерігається високе навантаження, спробуйте пізніше або зверніться до підтримки",
                "signingFailed": "Помилка підпису транзакції",
                "insufficientFundsForRentTitle": "Сума транзакції нижче мінімальної",
                "insufficientFundsForRent": "Недостатньо SOL для відправки на: {{address}}, потрібно ще {{amount}}"
            }
        }
    },
    "auth": {
        "phoneVerify": "Підтвердити телефон",
        "phoneNumber": "Номер телефону",
        "phoneTitle": "Ваш номер",
        "phoneSubtitle": "Ми надішлемо код підтвердження для перевірки\nвашого номера.",
        "codeTitle": "Введіть код",
        "codeSubtitle": "Ми надіслали код підтвердження на ",
        "codeHint": "Код",
        "title": "Увійти в {{name}}",
        "message": "запитує підключення до вашого гаманця {{wallet}}",
        "hint": "Жодні кошти не будуть передані до додатку та доступ до ваших монет не буде надано.",
        "action": "Дозволити",
        "expired": "Цей запит на аутентифікацію вже закінчився",
        "failed": "Аутентифікація не вдалася",
        "completed": "Цей запит на аутентифікацію вже завершено",
        "authorized": "Запит на авторизацію схвалено",
        "authorizedDescription": "Тепер ви можете повернутися до додатку.",
        "noExtensions": "Ще немає розширень",
        "noApps": "Ще немає підключених додатків",
        "name": "Підключені додатки",
        "yourWallet": "Ваш гаманець",
        "revoke": {
            "title": "Ви впевнені, що хочете відкликати цей додаток?",
            "message": "Це знищить зв'язок між вашим гаманцем і додатком, але ви завжди можете спробувати підключитися знову.",
            "action": "Відкликати"
        },
        "apps": {
            "title": "Довірені додатки",
            "delete": {
                "title": "Видалити це розширення?",
                "message": "Це знищить зв'язок між вашим гаманцем і розширенням, але ви завжди можете спробувати підключитися знову."
            },
            "description": "Тут будуть відображатися додатки або розширення, які ви авторизували. Ви можете відкликати доступ від будь-якого додатку або розширення в будь-який час.",
            "installExtension": "Встановіть і відкрийте розширення для цього додатку",
            "moreWallets": "Більше гаманців ({{count}})",
            "connectionSecureDescription": "Жодні кошти не будуть передані до додатку і доступ до ваших монет не буде надано",
            "invalidManifest": "Помилка манифесту додатку",
            "invalidManifestDescription": "Цей додаток не зміг підключитися до вашого гаманця. Будь ласка, зверніться до їхньої команди підтримки."
        },
        "consent": "Натискаючи продовжити, ви приймаєте наші"
    },
    "install": {
        "title": "Запит на підключення",
        "message": "<strong>{{name}}</strong> хоче підключитися до вашого акаунту",
        "action": "Встановити"
    },
    "sign": {
        "title": "Запит на підпис",
        "message": "Запит на підпис повідомлення",
        "hint": "Жодні кошти не будуть передані до додатку і доступ до ваших монет не буде надано.",
        "action": "Підписати",
        "binary": "Бінарне повідомлення"
    },
    "migrate": {
        "title": "Міграція старих гаманців",
        "subtitle": "Якщо ви використовували застарілі гаманці, ви можете автоматично перемістити всі кошти зі своїх старих адрес.",
        "inProgress": "Міграція старих гаманців...",
        "transfer": "Переміщення монет з {{address}}",
        "check": "Перевірка адреси {{address}}",
        "keyStoreTitle": "Перехід до нового методу безпеки",
        "keyStoreSubtitle": "Ми хочемо, щоб ваші ключі завжди були в безпеці, тому ми оновили спосіб їх захисту. Нам потрібен ваш дозвіл на перенесення ваших ключів до нового безпечного сховища.",
        "failed": "Міграція не вдалася"
    },
    "qr": {
        "title": "Наведіть камеру на QR-код",
        "requestingPermission": "Запит дозволу на використання камери...",
        "noPermission": "Дозвольте доступ до камери для сканування QR-кодів",
        "requestPermission": "Відкрити налаштування",
        "failedToReadFromImage": "Не вдалося прочитати QR-код з зображення",
        "galleryPermissionTitle": "Потрібен дозвіл",
        "galleryPermissionMessage": "Для сканування QR-кодів із ваших фотографій додатку потрібен доступ до галереї"
    },
    "products": {
        "addNew": "Додати продукт",
        "tonConnect": {
            "errors": {
                "connection": "Помилка з'єднання",
                "invalidKey": "Недійсний ключ dApp",
                "invalidSession": "Недійсна сесія",
                "invalidTestnetFlag": "Недійсна мережа",
                "alreadyCompleted": "Запит вже виконано",
                "unknown": "Невідома помилка, спробуйте ще раз або зверніться до підтримки"
            },
            "successAuth": "Підключено"
        },
        "savings": "Заощадження",
        "accounts": "Токени",
        "services": "Розширення",
        "oldWallets": {
            "title": "Старі гаманці",
            "subtitle": "Натисніть, щоб мігрувати старі гаманці"
        },
        "transactionRequest": {
            "title": "Запит транзакції",
            "subtitle": "Натисніть, щоб переглянути запит",
            "groupTitle": "Запити транзакцій",
            "wrongNetwork": "Неправильна мережа",
            "wrongFrom": "Неправильний відправник",
            "invalidFrom": "Недійсна адреса відправника",
            "noConnection": "Додаток не підключено",
            "expired": "Запит закінчився",
            "invalidRequest": "Недійсний запит",
            "failedToReport": "Транзакція відправлена, але не вдалося повідомити додаток",
            "failedToReportCanceled": "Транзакцію скасовано, але не вдалося повідомити додаток"
        },
        "signatureRequest": {
            "title": "Запит підпису",
            "subtitle": "Натисніть, щоб переглянути запит"
        },
        "staking": {
            "earnings": "Доходи",
            "title": "TON Стейкінг",
            "usdeTitle": "USDe Стейкінг",
            "balance": "Баланс стейкінгу",
            "subtitle": {
                "join": "Заробляйте до {{apy}}% на ваших {{tokenName}}",
                "joined": "Заробляйте до {{apy}}%",
                "rewards": "Оцінений відсоток",
                "apy": "~13.3 APY від внеску",
                "devPromo": "Помножте свої тестові монети"
            },
            "pools": {
                "title": "Стейкінг пули",
                "active": "Активні",
                "best": "Найкращі",
                "alternatives": "Альтернативні",
                "private": "Приватні пули",
                "restrictedTitle": "Пул обмежений",
                "restrictedMessage": "Цей стейкінг пул доступний лише для членів Whales Club",
                "viewClub": "Переглянути Whales Club",
                "nominators": "Номінатори",
                "nominatorsDescription": "Для всіх",
                "club": "Клуб",
                "clubDescription": "Для членів Whales Club",
                "team": "Команда",
                "teamDescription": "Для членів команди Ton Whales та ТОП 15 членів Whales Club",
                "joinClub": "Приєднатися",
                "joinTeam": "Приєднатися",
                "clubBanner": "Приєднуйтесь до нашого Клубу",
                "clubBannerLearnMore": "Дізнатися про наш клуб",
                "clubBannerDescription": "Для наших членів Whales Club",
                "teamBanner": "Приєднуйтесь до нашої Команди",
                "teamBannerLearnMore": "Дізнатися про нашу команду",
                "teamBannerDescription": "Для нашої команди та ТОП 15 членів Whales Club",
                "epnPartners": "ePN Партнери",
                "epnPartnersDescription": "Приєднуйтесь до понад 200,000 вебмайстрів",
                "moreAboutEPN": "Інформація",
                "lockups": "Пул Lockups",
                "lockupsDescription": "Дозволяє власникам великих lockups у TON заробляти додатковий дохід",
                "tonkeeper": "Tonkeeper",
                "tonkeeperDescription": "Зручний мобільний гаманець на TON",
                "liquid": "Ліквідний стейкінг",
                "liquidDescription": "Надішліть TON на стейкінг і отримайте wsTON токени натомість",
                "rateTitle": "Обмінний курс",
                "liquidUsde": "USDe Liquid Staking",
                "liquidUsdeDescription": "Надішліть USDe на стейкінг і отримайте tsUSDe токени натомість",
                "ethenaPoints": "Отримати більше винагород",
                "ethenaPointsDescription": "Завершіть верифікацію, щоб збільшити свої винагороди за стейкінг",
            },
            "transfer": {
                "stakingWarning": "Ви завжди можете внести нову ставку або збільшити існуючу на будь-яку суму. Зверніть увагу, що мінімальна сума становить: {{minAmount}}",
                "depositStakeTitle": "Ставка",
                "depositStakeConfirmTitle": "Підтвердити ставку",
                "withdrawStakeTitle": "Запит на зняття",
                "withdrawStakeConfirmTitle": "Підтвердити зняття",
                "topUpTitle": "Поповнення",
                "topUpConfirmTitle": "Підтвердити поповнення",
                "notEnoughStaked": "на жаль, у вас недостатньо монет для ставки",
                "confirmWithdraw": "Запит на зняття",
                "confirmWithdrawReady": "Зняти зараз",
                "restrictedTitle": "Цей пул ставок обмежений",
                "restrictedMessage": "Ваші кошти не братимуть участі у ставках, якщо адреса вашого гаманця не входить до списку дозволених, але будуть на балансі пулу і чекатимуть на зняття",
                "notEnoughCoinsFee": "На балансі вашого гаманця недостатньо TON для оплати комісії. Зверніть увагу, що комісія {{amount}} TON повинна бути на основному балансі, а не на балансі ставок",
                "notEnoughCoins": "На балансі вашого гаманця недостатньо коштів для поповнення балансу ставок",
                "ledgerSignText": "Ставка: {{action}}"
            },
            "nextCycle": "Наступний цикл",
            "cycleNote": "Усі транзакції набувають чинності після завершення циклу",
            "cycleNoteWithdraw": "Ваш запит буде виконано після завершення циклу. Зняття потрібно буде підтвердити ще раз.",
            "buttonTitle": "ставка",
            "balanceTitle": "Баланс ставок",
            "actions": {
                "deposit": "Депозит",
                "top_up": "Поповнення",
                "withdraw": "Зняття",
                "calc": "Розрахувати",
                "swap": "Миттєвий обмін"
            },
            "join": {
                "title": "Станьте валідатором TON",
                "message": "Ставка - це суспільне благо для екосистеми TON. Ви можете допомогти забезпечити мережу та отримати винагороди в процесі",
                "buttonTitle": "Почати заробляти",
                "moreAbout": "Детальніше про пул ставок Ton Whales",
                "earn": "Заробляйте до",
                "onYourTons": "на ваших TON",
                "apy": "13.3%",
                "yearly": "APY",
                "cycle": "Отримуйте винагороди за ставки кожні 36 годин",
                "ownership": "Залишайтеся власником своїх TON",
                "withdraw": "Знімайте та поповнюйте в будь-який час",
                "successTitle": "{{amount}} TON поставлено",
                "successEtimation": "Ваші орієнтовні річні заробітки становлять {{amount}}\u00A0TON\u00A0(${{price}}).",
                "successNote": "Ваші поставлені TON будуть активовані після початку наступного циклу."
            },
            "pool": {
                "balance": "Загальна ставка",
                "members": "Номінатори",
                "profitability": "Прибутковість"
            },
            "empty": {
                "message": "У вас немає транзакцій"
            },
            "pending": "в очікуванні",
            "withdrawStatus": {
                "pending": "Виведення в очікуванні",
                "ready": "Виведення готове",
                "withdrawNow": "Натисніть, щоб вивести зараз"
            },
            "depositStatus": {
                "pending": "Депозит в очікуванні"
            },
            "withdraw": "Вивести",
            "sync": "Завантаження даних стейкінгу",
            "unstake": {
                "title": "Ви впевнені, що хочете запросити виведення?",
                "message": "Зверніть увагу, що при запиті на виведення всі очікуючі депозити також будуть повернуті."
            },
            "unstakeLiquid": {
                "title": "Виведіть ваш wsTON",
                "message": "Ви можете вивести кошти безпосередньо після закінчення циклу або миттєво обміняти wsTON на TON на "
            },
            "unstakeLiquidUsde": {
                "title": "Виведіть ваш tsUSDe",
                "message": "Ви можете вивести кошти безпосередньо після закінчення періоду блокування (7 днів після першого запиту на виведення) або миттєво обміняти tsUSDe на USDe на "
            },
            "learnMore": "Інформація",
            "moreInfo": "Більше інформації",
            "calc": {
                "yearly": "Річні винагороди",
                "monthly": "Місячні винагороди",
                "daily": "Щоденні винагороди",
                "note": "Розраховано з урахуванням всіх комісій",
                "text": "Калькулятор заробітку",
                "yearlyTopUp": "Прибуток після поповнення",
                "yearlyTotal": "Загальні винагороди за рік",
                "yearlyCurrent": "Поточний прибуток (за рік)",
                "topUpTitle": "Ваші річні винагороди",
                "goToTopUp": "Перейти до поповнення"
            },
            "info": {
                "rate": "до 13.3%",
                "rateTitle": "APY",
                "frequency": "Кожні 36 годин",
                "frequencyTitle": "Частота винагород",
                "minDeposit": "Мінімальний депозит",
                "poolFee": "3.3%",
                "poolFeeTitle": "Комісія пулу",
                "depositFee": "Комісія за депозит",
                "withdrawFee": "Комісія за виведення",
                "withdrawRequestFee": "Комісія за запит на виведення",
                "withdrawCompleteFee": "Комісія за завершення виведення",
                "depositFeeDescription": "Сума TON, яка буде вирахувана з суми депозиту для покриття комісій за дію депозиту, невикористана сума буде повернена на ваш баланс гаманця",
                "withdrawFeeDescription": "Сума TON, необхідна для покриття комісій за дію виведення, невикористана сума буде повернена на ваш баланс гаманця",
                "withdrawCompleteDescription": "Сума TON, необхідна для покриття комісій за завершення дії виведення, невикористана сума буде повернена на ваш баланс гаманця",
                "blockchainFee": "Комісія блокчейну",
                "cooldownTitle": "Спрощений період",
                "cooldownActive": "Активний",
                "cooldownInactive": "Неактивний",
                "cooldownDescription": "Всі транзакції набувають чинності миттєво протягом цього періоду",
                "cooldownAlert": "На початку кожного циклу стейкінгу активний Спрощений період. Протягом цього періоду вам не потрібно чекати закінчення циклу для виведення або поповнення - це відбувається миттєво, і вам не потрібно надсилати другу транзакцію для виведення, що зменшує комісію за виведення вдвічі. Ви можете переводити кошти з одного пулу в інший без втрати прибутку за цикл, якщо Спрощений період активний в обох пулах",
                "lockedAlert": "Під час прогресу циклу стейкінгу виведення та депозити очікують. Всі транзакції набувають чинності після закінчення циклу"
            },
            "minAmountWarning": "Мінімальна сума {{minAmount}} TON",
            "tryAgainLater": "Будь ласка, спробуйте пізніше",
            "banner": {
                "estimatedEarnings": "Ваші очікувані річні заробітки зменшаться на {{amount}}\u00A0TON\u00A0({{price}})",
                "estimatedEarningsDev": "Ваші очікувані річні заробітки зменшаться",
                "message": "Ви впевнені щодо виведення?"
            },
            "activePools": "Активні пули",
            "analytics": {
                "operations": "Операції",
                "operationsDescription": "Поповнення та зняття",
                "analyticsTitle": "Аналітика",
                "analyticsSubtitle": "Загальний прибуток",
                "labels": {
                    "week": "1Т",
                    "month": "1М",
                    "year": "1Р",
                    "allTime": "Всі"
                }
            }
        },
        holders: {
            title: 'Банківський рахунок',
            loadingLongerTitle: 'Проблеми з підключенням',
            loadingLonger: 'Перевірте підключення до інтернету та перезавантажте сторінку. Якщо проблема не зникає, зверніться до служби підтримки',
            accounts: {
                title: 'Витрати',
                prepaidTitle: 'Передплачені картки',
                account: 'Рахунок',
                basicAccount: 'Рахунок для витрат',
                proAccount: 'Про рахунок',
                noCards: 'Немає карток',
                prepaidCard: 'Tonhub Prepaid *{{lastFourDigits}}',
                prepaidCardDescription: 'Поповнювана картка для щоденного використання',
                hiddenCards: 'Приховані картки',
                hiddenAccounts: 'Приховані рахунки',
                primaryName: 'Основний рахунок',
                paymentName: 'Платіжний рахунок {{accountIndex}}',
                topUp: 'Поповнити рахунок',
                addNew: 'Додати рахунок',
                network: 'Мережа {{networkName}}',
            },
            "pageTitles": {
                "general": "Tonhub Карти",
                "card": "Tonhub Картка",
                "cardDetails": "Деталі картки",
                "cardCredentials": "Деталі картки",
                "cardLimits": "{{cardNumber}} Ліміти картки",
                "cardLimitsDefault": "Ліміти картки",
                "cardDeposit": "Поповнити TON",
                "transfer": "Переказ",
                "cardSmartContract": "Смарт-контракт картки",
                "setUpCard": "Налаштувати картку",
                "pin": "Змінити PIN"
            },
            "card": {
                "card": "Картка",
                "cards": "Картки власників",
                "title": "Tonhub картка {{cardNumber}}",
                "defaultSubtitle": "Платіть USDT або TON скрізь за допомогою картки",
                "defaultTitle": "Tonhub картка",
                "eurSubtitle": "Tonhub EUR",
                "type": {
                    "physical": "Фізична картка",
                    "virtual": "Віртуальна"
                },
                "notifications": {
                    "type": {
                        "card_ready": "Картка активована",
                        "deposit": "Поповнення картки",
                        "charge": "Платіж",
                        "charge_failed": "Платіж",
                        "limits_change": {
                            "pending": "Зміна лімітів",
                            "completed": "Ліміти змінено"
                        },
                        "card_withdraw": "Переказ на гаманець",
                        "contract_closed": "Контракт закрито",
                        "card_block": "Картка заблокована",
                        "card_freeze": "Картка заморожена",
                        "card_unfreeze": "Картка розморожена",
                        "card_paid": "Випуск банківської картки"
                    },
                    "category": {
                        "deposit": "Поповнення",
                        "card_withdraw": "Переказ",
                        "charge": "Покупки",
                        "charge_failed": "Покупки",
                        "other": "Інше"
                    },
                    "status": {
                        "charge_failed": {
                            "limit": {
                                "onetime": "Не вдалося (перевищено одноразовий ліміт)",
                                "daily": "Не вдалося (перевищено денний ліміт)",
                                "monthly": "Не вдалося (перевищено місячний ліміт)"
                            },
                            "failed": "Не вдалося"
                        },
                        "completed": "Завершено"
                    }
                }
            },
            "confirm": {
                "title": "Ви впевнені, що хочете закрити цей екран?",
                "message": "Ця дія скасує всі ваші зміни"
            },
            "enroll": {
                "poweredBy": "На основі TON, підтримується ZenPay",
                "description_1": "Тільки ви керуєте смарт-контрактом",
                "description_2": "Ніхто, крім вас, не має доступу до ваших коштів",
                "description_3": "Ви дійсно володієте своїми грошима",
                "moreInfo": "Детальніше про ZenPay Card",
                "buttonSub": "KYC та випуск картки займає ~5 хвилин",
                "failed": {
                    "title": "Не вдалося авторизуватися",
                    "noAppData": "Немає даних додатку",
                    "noDomainKey": "Немає ключа домену",
                    "createDomainKey": "Під час створення ключа домену",
                    "fetchToken": "Під час отримання токена",
                    "createSignature": "Під час створення підпису"
                },
                "ledger": {
                    "confirmTitle": "Продовжити з Ledger",
                    "confirmMessage": "Підпишіть авторизацію та підтвердіть адресу гаманця"
                }
            },
            "otpBanner": {
                "title": "Новий запит на оплату",
                "accept": "Прийняти",
                "decline": "Відхилити",
                "expired": "Закінчився"
            },
            "banner": {
                "fewMore": "Залишилося всього кілька кроків",
                "ready": "Верифікація завершена! Ваша картка готова!",
                "readyAction": "Отримати зараз",
                "emailAction": "Підтвердіть пошту",
                "kycAction": "Пройдіть верифікацію",
                "failedAction": "Верифікація не вдалася"
            },
            "transaction": {
                "type": {
                    "cardReady": "Картка активована",
                    "accountReady": "Акаунт активовано",
                    "deposit": "Поповнення акаунту",
                    "prepaidTopUp": "Поповнення передплаченої картки",
                    "payment": "Платіж",
                    "decline": "Відхилено",
                    "refund": "Повернення коштів",
                    "limitsChanging": "Зміна лімітів",
                    "limitsChanged": "Ліміти змінено",
                    "cardWithdraw": "Переказ на гаманець",
                    "contractClosed": "Контракт закрито",
                    "cardBlock": "Картку заблоковано",
                    "cardFreeze": "Картку заморожено",
                    "cardUnfreeze": "Картку розморожено",
                    "cardPaid": "Випуск банківської картки",
                    "unknown": "Невідомо"
                },
                "rejectReason": {
                    "approve": "н/д",
                    "generic": "Виникла проблема. Будь ласка, спробуйте ще раз. Якщо помилка залишається, зверніться до служби підтримки для допомоги",
                    "fraud_or_ban": "Виникла проблема. Будь ласка, спробуйте ще раз. Якщо помилка залишається, зверніться до служби підтримки для допомоги",
                    "not_able_to_trace_back_to_original_transaction": "Виникла проблема. Будь ласка, спробуйте ще раз. Якщо помилка залишається, зверніться до служби підтримки для допомоги",
                    "do_not_honour": "Ми не можемо виконати операцію для цього продавця",
                    "card_not_effective": "Транзакцію відхилено, оскільки ваша картка наразі заблокована. Щоб продовжити, розблокуйте картку через мобільний додаток або зверніться до служби підтримки для допомоги",
                    "expired_card": "Термін дії вашої картки закінчився. Будь ласка, замовте нову через мобільний додаток",
                    "incorrect_pin": "Схоже, виникла проблема з вашим PIN-кодом. Будь ласка, перевірте дані та спробуйте ще раз. Якщо проблема залишається, зверніться до служби підтримки для допомоги",
                    "cvc2_or_cvv2_incorrect": "CVV неправильний. Будь ласка, перевірте тризначний код на звороті вашої картки та спробуйте ще раз",
                    "incorrect_expiry_date": "Дата закінчення терміну дії, яку ви ввели, неправильна. Будь ласка, перевірте дату закінчення терміну дії на вашій картці або в мобільному додатку та спробуйте ще раз",
                    "invalid_card_number": "Номер картки, який ви ввели, неправильний. Будь ласка, перевірте номер на вашій картці або в мобільному додатку та спробуйте ще раз",
                    "blocked_merchant_country_code": "Ваша картка не може бути використана для транзакцій у цій країні",
                    "insufficient_funds": "У вас недостатньо коштів на рахунку для завершення цієї транзакції. Будь ласка, поповніть рахунок і спробуйте ще раз",
                    "exceeds_contactless_payments_daily_limit": "Транзакцію відхилено, оскільки вона перевищує ваш денний ліміт витрат. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз завтра",
                    "exceeds_contactless_payments_monthly_limit": "Транзакцію відхилено, оскільки вона перевищує ваш місячний ліміт витрат. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз пізніше",
                    "exceeds_contactless_payments_transaction_limit": "Транзакцію відхилено, оскільки вона перевищує максимальну суму транзакції. Будь ласка, зверніться до служби підтримки для допомоги",
                    "exceeds_contactless_payments_weekly_limit": "Транзакцію відхилено, оскільки вона перевищує ваш тижневий ліміт витрат. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз пізніше",
                    "exceeds_daily_overall_limit": "Транзакцію відхилено, оскільки вона перевищує ваш денний ліміт витрат на картці. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз завтра",
                    "exceeds_internet_purchase_payments_daily_limit": "Транзакцію відхилено, оскільки вона перевищує ваш денний ліміт для інтернет-транзакцій. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз завтра",
                    "exceeds_internet_purchase_payments_monthly_limit": "Транзакцію відхилено, оскільки вона перевищує ваш місячний ліміт для інтернет-транзакцій. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз пізніше",
                    "exceeds_internet_purchase_payments_transaction_limit": "Транзакцію відхилено, оскільки вона перевищує максимальну суму транзакції. Будь ласка, зверніться до служби підтримки для допомоги",
                    "exceeds_internet_purchase_payments_weekly_limit": "Транзакцію відхилено, оскільки вона перевищує ваш тижневий ліміт для інтернет-транзакцій. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз пізніше",
                    "exceeds_monthly_overall_limit": "Транзакцію відхилено, оскільки вона перевищує ваш місячний ліміт витрат на картці. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз пізніше",
                    "exceeds_purchases_daily_limit": "Транзакцію відхилено, оскільки вона перевищує ваш денний ліміт витрат на картці. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз завтра",
                    "exceeds_purchases_monthly_limit": "Транзакцію відхилено, оскільки вона перевищує ваш місячний ліміт витрат на картці. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз пізніше",
                    "exceeds_purchases_transaction_limit": "Транзакцію відхилено, оскільки вона перевищує максимальну суму транзакції. Будь ласка, зверніться до служби підтримки для допомоги",
                    "exceeds_purchases_weekly_limit": "Транзакцію відхилено, оскільки вона перевищує ваш тижневий ліміт витрат на картці. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз пізніше",
                    "exceeds_settlement_risk_limit": "Транзакцію відхилено, оскільки вона перевищує максимальну суму транзакції. Будь ласка, зверніться до служби підтримки для допомоги",
                    "exceeds_weekly_overall_limit": "Транзакцію відхилено, оскільки вона перевищує ваш тижневий ліміт витрат на картці. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте ще раз пізніше",
                    "exceeds_withdrawal_amount_limit": "Транзакцію відхилено, оскільки вона перевищує ліміт зняття готівки на картці. Будь ласка, зверніться до служби підтримки для допомоги",
                    "exceeds_withdrawal_maximum_limit": "Транзакцію відхилено, оскільки вона перевищує ліміт зняття готівки на картці. Будь ласка, зверніться до служби підтримки для допомоги",
                    "exceeds_withdrawal_minimum_limit": "Сума транзакції неправильна",
                    "exceeds_withdrawals_daily_limit": "Транзакцію відхилено, оскільки вона перевищує денний ліміт зняття готівки на картці. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте завтра",
                    "exceeds_withdrawals_monthly_limit": "Транзакцію відхилено, оскільки вона перевищує місячний ліміт зняття готівки на картці. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте пізніше",
                    "exceeds_withdrawals_transaction_limit": "Транзакцію відхилено, оскільки вона перевищує ліміт зняття готівки на картці. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте завтра",
                    "exceeds_withdrawals_weekly_limit": "Транзакцію відхилено, оскільки вона перевищує тижневий ліміт зняття готівки на картці. Будь ласка, зверніться до служби підтримки для допомоги або спробуйте пізніше",
                    "transaction_not_permitted_to_card_holder": "Тип транзакції не підтримується. Будь ласка, зверніться до продавця",
                    "blocked_merchant_category_code": "Ми не можемо виконати операцію для цього продавця",
                    "blocked_merchant_id": "Ми не можемо виконати операцію для цього продавця",
                    "blocked_merchant_name": "Ми не можемо виконати операцію для цього продавця",
                    "blocked_terminal_id": "Виникла проблема. Будь ласка, спробуйте ще раз. Якщо помилка залишається, зверніться до служби підтримки для допомоги",
                    "no_card_record": "Виникла проблема. Будь ласка, спробуйте ще раз. Якщо помилка залишається, зверніться до служби підтримки для допомоги",
                    "suspected_fraud": "Виникла проблема. Будь ласка, спробуйте ще раз. Якщо помилка залишається, зверніться до служби підтримки для допомоги",
                    "token_not_effective": "Виникла проблема. Будь ласка, спробуйте ще раз. Якщо помилка залишається, зверніться до служби підтримки для допомоги",
                    "client_system_malfunction": "Виникла проблема. Будь ласка, спробуйте ще раз. Якщо помилка залишається, зверніться до служби підтримки для допомоги",
                    "system_malfunction": "Виникла проблема. Будь ласка, спробуйте ще раз. Якщо помилка залишається, зверніться до служби підтримки для допомоги",
                    "contactless_payments_switched_off": "Транзакцію відхилено, оскільки безконтактні платежі наразі вимкнені на вашій картці. Будь ласка, зверніться до служби підтримки для допомоги",
                    "internet_purchase_payments_switched_off": "Транзакцію відхилено, оскільки інтернет-покупки наразі вимкнені на вашій картці. Будь ласка, зверніться до служби підтримки для допомоги",
                    "withdrawals_switched_off": "Транзакцію відхилено, оскільки зняття готівки наразі вимкнено на вашій картці. Будь ласка, зверніться до служби підтримки для допомоги",
                    "purchases_switched_off": "Транзакцію відхилено, оскільки покупки наразі вимкнені на вашій картці. Будь ласка, зверніться до служби підтримки для допомоги",
                    "advice_acknowledged_no_financial_liability_accepted": "Ми не можемо виконати операцію для цього продавця",
                    "merchant_without_3ds": "Ми не можемо виконати операцію для цього продавця"
                },
                "to": {
                    "single": "До",
                    "prepaidCard": "До передплаченої картки",
                    "wallet": "До гаманця",
                    "account": "До акаунту"
                },
                "from": {
                    "single": "Від",
                    "prepaidCard": "Від передплаченої картки",
                    "wallet": "Від гаманця",
                    "account": "Від акаунту"
                },
                "category": {
                    "transfers": "Виведення коштів",
                    "purchase": "Покупка",
                    "cash": "Зняття готівки",
                    "other": "Інше",
                    "deposit": "Поповнення"
                },
                "status": {
                    "failed": "Не вдалося",
                    "overOnetimeFailed": "Не вдалося (перевищено одноразовий ліміт)",
                    "overDailyFailed": "Не вдалося (перевищено денний ліміт)",
                    "overMonthlyFailed": "Не вдалося (перевищено місячний ліміт)",
                    "complete": "Завершено"
                },
                "statsBlock": {
                    "title": "Транзакції",
                    "description": "Витрати у {{month}}",
                    "spent": "Витрачено",
                    "in": "у {{month}}"
                },
                "list": {
                    "emptyText": "Транзакцій ще немає"
                },
                "single": {
                    "report": "Повідомити про проблему"
                },
                "pendingPopover": {
                    "title": "Очікувана транзакція",
                    "cancelButtonText": "Показати деталі транзакції",
                    "text": "В даний час триває перевірка блокчейну. Це може зайняти кілька хвилин"
                }
            },
            "noDirectDeposit": {
                "warningTitle": "Прямий депозит не підтримується",
                "alertTitle": "Ми оновили контракт",
                "alertDescription": "Будь ласка, створіть новий акаунт і переведіть на нього всі ваші кошти та картки. Це безпечніше і підтримує прямі депозити",
                "buttonTitle": "Створити новий акаунт"
            }
        }
    },
    "welcome": {
        "title": "Tonhub",
        "titleDev": "Ton Sandbox Wallet",
        "subtitle": "Простий та безпечний гаманець TON",
        "subtitleDev": "Гаманець для розробників",
        "createWallet": "Отримати новий гаманець",
        "importWallet": "У мене вже є гаманець",
        "slogan": "Це новий Tonhub",
        "sloganDev": "Це Ton Sandbox",
        "slide_1": {
            "title": "Захищений",
            "subtitle": "Надійний смарт-контракт, Touch/Face ID з паролем та всі транзакції на децентралізованому блокчейні"
        },
        "slide_2": {
            "title": "З крутою криптокартою",
            "subtitle": "Замовте карту зараз. Внутрішні перекази та покупки за хвилини.\nВсе це унікальна карта Tonhub"
        },
        "slide_3": {
            "title": "Швидкий",
            "subtitle": "Завдяки унікальній архітектурі TON, транзакції відбуваються за секунди"
        }
    },
    "legal": {
        "title": "Юридичні",
        "subtitle": "Я прочитав і приймаю ",
        "create": "Створити резервну копію",
        "createSubtitle": "Зберігайте свій приватний ключ у безпеці та не діліться ним з іншими. Це єдиний спосіб отримати доступ до вашого гаманця, якщо пристрій буде втрачено.",
        "privacyPolicy": "Політика конфіденційності",
        "termsOfService": "Умови використання"
    },
    "create": {
        "addNew": "Додати новий гаманець",
        "inProgress": "Створення...",
        "backupTitle": "Ваш резервний ключ",
        "backupSubtitle": "Запишіть ці 24 слова в точному порядку та збережіть їх у секретному місці",
        "okSaved": "Добре, я зберіг це",
        "copy": "Скопіювати в буфер обміну"
    },
    "import": {
        "title": "Введіть резервний ключ",
        "subtitle": "Будь ласка, відновіть доступ до вашого гаманця, ввівши 24 секретні слова, які ви записали під час створення гаманця",
        "fullSeedPlaceholder": "Введіть 24 секретні слова",
        "fullSeedPaste": "Або ви можете вставити повну фразу з насінням, де кожне слово розділене пробілом"
    },
    "secure": {
        "title": "Захистіть свій гаманець",
        "titleUnprotected": "Ваш пристрій не захищений",
        "subtitle": "Ми використовуємо біометрію для аутентифікації транзакцій, щоб переконатися, що ніхто, крім вас, не може перевести ваші монети.",
        "subtitleUnprotected": "Наполегливо рекомендується увімкнути пароль на вашому пристрої для захисту ваших активів.",
        "subtitleNoBiometrics": "Наполегливо рекомендується увімкнути біометрію на вашому пристрої для захисту ваших активів. Ми використовуємо біометрію для аутентифікації транзакцій, щоб переконатися, що ніхто, крім вас, не може перевести ваші монети.",
        "messageNoBiometrics": "Наполегливо рекомендується увімкнути біометрію на вашому пристрої для захисту ваших активів.",
        "protectFaceID": "Увімкнути Face ID",
        "protectTouchID": "Увімкнути Touch ID",
        "protectBiometrics": "Увімкнути біометрію",
        "protectPasscode": "Увімкнути пароль пристрою",
        "upgradeTitle": "Потрібне оновлення",
        "upgradeMessage": "Будь ласка, дозвольте додатку доступ до ключів гаманця для оновлення. Під час цього оновлення кошти не будуть переведені. Будь ласка, переконайтеся, що ви зробили резервну копію своїх ключів.",
        "allowUpgrade": "Дозволити оновлення",
        "backup": "Резервні секретні слова",
        "onLaterTitle": "Налаштувати пізніше",
        "onLaterMessage": "Ви можете налаштувати захист пізніше.",
        "onLaterButton": "Налаштувати пізніше",
        "onBiometricsError": "Помилка аутентифікації за допомогою біометрії",
        "lockAppWithAuth": "Аутентифікуватися при вході в додаток",
        "methodPasscode": "пароль",
        "passcodeSetupDescription": "PIN-код допомагає захистити ваш гаманець від несанкціонованого доступу"
    },
    "backup": {
        "title": "Ваша фраза для відновлення",
        "subtitle": "Запишіть ці 24 слова в порядку, наведеному нижче, і збережіть їх у секретному, безпечному місці."
    },
    "backupIntro": {
        "title": "Зробіть резервну копію вашого гаманця",
        "subtitle": "Ви впевнені, що зберегли свої 24 секретні слова?",
        "saved": "Так, я зберіг їх",
        "goToBackup": "Ні, перейти до резервного копіювання"
    },
    "errors": {
        "incorrectWords": {
            "title": "Неправильні слова",
            "message": "Ви ввели неправильні секретні слова. Будь ласка, перевірте свій ввід і спробуйте ще раз."
        },
        "secureStorageError": {
            "title": "Помилка безпечного зберігання",
            "message": "На жаль, ми не можемо зберегти дані."
        },
        "title": "Упс",
        "invalidNumber": "Ні, це не справжній номер. Будь ласка, перевірте свій ввід і спробуйте ще раз.",
        "codeTooManyAttempts": "Ви спробували занадто багато разів, будь ласка, спробуйте ще раз через 15 хвилин.",
        "codeInvalid": "Ні, введений код недійсний. Перевірте код і спробуйте ще раз.",
        "unknown": "Вау, це невідома помилка. Я буквально не знаю, що відбувається. Можете спробувати вимкнути та ввімкнути?"
    },
    "confirm": {
        "logout": {
            "title": "Ви впевнені, що хочете відключити свій гаманець від цього додатку та видалити всі ваші дані з додатку?",
            "message": "Ця дія призведе до видалення всіх облікових записів з цього пристрою. Переконайтеся, що ви зробили резервну копію своїх 24 секретних слів перед продовженням."
        },
        "changeCurrency": "Змінити основну валюту на {{currency}}"
    },
    "neocrypto": {
        "buttonTitle": "купити",
        "alert": {
            "title": "Як працює оформлення замовлення",
            "message": "Заповніть необхідні поля -> Виберіть криптовалюту та вкажіть адресу гаманця і суму для покупки -> Перейдіть до оформлення замовлення -> Введіть свої платіжні дані правильно. Оплата кредитною карткою безпечно обробляється нашими партнерами -> Завершіть покупку. Обліковий запис не потрібен!"
        },
        "title": "Купуйте TON за допомогою кредитної картки за USD, EUR та RUB",
        "description": "Ви будете перенаправлені на Neocrypto. Послуги, пов'язані з платежами, надаються Neocrypto, яка є окремою платформою, що належить третій стороні\n\nБудь ласка, прочитайте та погодьтеся з Умовами обслуговування Neocrypto перед використанням їхніх послуг",
        "doNotShow": "Більше не показувати для Neocrypto",
        "termsAndPrivacy": "Я прочитав і погоджуюся з ",
        "confirm": {
            "title": "Ви впевнені, що хочете закрити цю форму?",
            "message": "Ця дія скасує всі ваші зміни"
        }
    },
    "known": {
        "deposit": "Депозит",
        "depositOk": "Депозит прийнято",
        "withdraw": "Запит на виведення {{coins}} TON",
        "withdrawAll": "Запит на виведення всіх монет",
        "withdrawLiquid": "Вивести",
        "withdrawCompleted": "Виведення завершено",
        "withdrawRequested": "Запит на виведення",
        "upgrade": "Оновити код до {{hash}}",
        "upgradeOk": "Оновлення завершено",
        "cashback": "Токенбек",
        "tokenSent": "Токен відправлено",
        "tokenReceived": "Токен отримано",
        "holders": {
            "topUpTitle": "Поповнити суму",
            "accountTopUp": "Поповнення рахунку на {{amount}} TON",
            "accountJettonTopUp": "Поповнення рахунку",
            "limitsChange": "Зміна лімітів",
            "limitsTitle": "Ліміти",
            "limitsOneTime": "За транзакцію",
            "limitsDaily": "Щоденно",
            "limitsMonthly": "Щомісяця",
            "accountLimitsChange": "Зміна лімітів"
        }
    },
    "jetton": {
        "token": "токен",
        "productButtonTitle": "Токени",
        "productButtonSubtitle": "{{jettonName}} та {{count}} інших",
        "hidden": "Приховані токени",
        "liquidPoolDescriptionDedust": "Ліквідність для {{name0}}/{{name1}} на DeDust DEX",
        "liquidPoolDescriptionStonFi": "Ліквідність для {{name0}}/{{name1}} на STON.fi DEX",
        "emptyBalance": "Порожній баланс",
        "jettonsNotFound": "Токени не знайдено"
    },
    "connections": {
        "extensions": "Розширення",
        "connections": "З'єднання"
    },
    "accounts": {
        "active": "Активний",
        "noActive": "Немає активних рахунків",
        "disabled": "Приховано",
        "alertActive": "Позначити {{symbol}} активним",
        "alertDisabled": "Позначити {{symbol}} прихованим",
        "description": "Щоб змінити статус рахунку, довго натисніть кнопку рахунку на головному екрані або натисніть у цьому меню. Рахунок буде додано на головний екран або приховано.",
        "noAccounts": "У вас ще немає рахунків"
    },
    "spamFilter": {
        "minAmount": "Мінімальна сума TON",
        "dontShowComments": "Не показувати коментарі до СПАМ транзакцій",
        "minAmountDescription": "Транзакції з сумою TON менше {{amount}} будуть автоматично позначені як СПАМ",
        "applyConfig": "Застосувати вибрані налаштування фільтра СПАМ",
        "denyList": "Ручний фільтр спаму",
        "denyListEmpty": "Немає заблокованих адрес",
        "unblockConfirm": "Розблокувати адресу",
        "blockConfirm": "Позначити адресу як спам",
        "description": "Ви можете легко додати адресу до списку вручну заблокованих адрес, якщо натиснете на будь-яку транзакцію або адресу та виберете опцію \"Позначити адресу як спам\" у спливаючому меню"
    },
    "security": {
        "title": "Безпека",
        "passcodeSettings": {
            "setupTitle": "Налаштування PIN-коду",
            "confirmTitle": "Підтвердження PIN-коду",
            "changeTitle": "Зміна PIN-коду",
            "resetTitle": "Скидання PIN-коду",
            "resetDescription": "Якщо ви забули свій PIN-код, ви можете скинути його, ввівши 24 секретні слова, які ви записали під час створення гаманця.",
            "resetAction": "Скинути",
            "error": "Неправильний PIN-код",
            "tryAgain": "Спробуйте ще раз",
            "success": "PIN-код успішно встановлено",
            "enterNew": "Створити PIN-код",
            "confirmNew": "Підтвердити новий PIN-код",
            "enterCurrent": "Введіть свій PIN-код",
            "enterPrevious": "Введіть поточний PIN-код",
            "enterNewDescription": "Встановлення пароля забезпечує додатковий рівень безпеки під час використання програми",
            "changeLength": "Використовуйте {{length}}-значний PIN-код",
            "forgotPasscode": "Забули PIN-код?",
            "logoutAndReset": "Вийти та скинути PIN-код"
        },
        "auth": {
            "biometricsPermissionCheck": {
                "title": "Потрібен дозвіл",
                "message": "Будь ласка, дозвольте додатку доступ до біометрії для автентифікації",
                "openSettings": "Відкрити налаштування",
                "authenticate": "Аутентифікація за допомогою пароля"
            },
            "biometricsSetupAgain": {
                "title": "Виявлено нову біометрію",
                "message": "Будь ласка, налаштуйте біометрію знову в налаштуваннях безпеки",
                "setup": "Налаштувати",
                "authenticate": "Продовжити з паролем"
            },
            "biometricsCooldown": {
                "title": "Тайм-аут біометрії",
                "message": "Будь ласка, спробуйте пізніше або заблокуйте свій пристрій і розблокуйте його знову за допомогою пароля пристрою, щоб увімкнути біометрію"
            },
            "biometricsCorrupted": {
                "title": "Біометрія пошкоджена і PIN-код не встановлено",
                "message": "На жаль, ваш гаманець більше недоступний, щоб відновити гаманець, натисніть \"Відновити\" (ви будете виведені з поточного гаманця) і введіть свої 24 секретні слова",
                "messageLogout": "На жаль, ваш гаманець більше недоступний, щоб відновити гаманець, натисніть \"Вийти\" (ви будете виведені з поточного гаманця) і додайте свій гаманець знову",
                "logout": "Вийти",
                "restore": "Відновити"
            },
            "canceled": {
                "title": "Скасовано",
                "message": "Аутентифікацію скасовано, будь ласка, спробуйте ще раз"
            }
        }
    },
    "report": {
        "title": "Звіт",
        "scam": "шахрайство",
        "bug": "помилка",
        "spam": "спам",
        "offense": "образливий контент",
        "posted": "Ваш звіт надіслано",
        "error": "Помилка при надсиланні звіту",
        "message": "Повідомлення (обов'язково)",
        "reason": "Причина звіту"
    },
    "review": {
        "title": "Огляд розширення",
        "rating": "рейтинг",
        "review": "Відгук (необов'язково)",
        "heading": "Заголовок",
        "error": "Помилка при публікації відгуку",
        "posted": "Дякуємо за ваш відгук!",
        "postedDescription": "Ваш відгук буде опубліковано після модерації"
    },
    "deleteAccount": {
        "title": "Ви впевнені, що хочете видалити обліковий запис?",
        "action": "Видалити обліковий запис і всі дані",
        "logOutAndDelete": "Вийти і видалити всі дані",
        "description": "Ця дія видалить всі дані та поточний вибраний гаманець з цього пристрою та вашого блокчейн-акаунту\nВам потрібно перевести всі ваші TON монети на інший гаманець. Перед продовженням переконайтеся, що у вас на рахунку більше ніж {{amount}} TON для завершення транзакції",
        "complete": "Видалення облікового запису завершено",
        "error": {
            "hasNfts": "У вас є NFT у вашому гаманці, щоб видалити обліковий запис, будь ласка, надішліть їх на інший гаманець.",
            "fetchingNfts": "Не вдалося визначити, чи є NFT у гаманці. Щоб видалити обліковий запис, переконайтеся, що у ньому немає NFT.",
            "hasUSDTBalanceTitle": "У вас є баланс USDT у вашому гаманці",
            "hasUSDTBalanceMessage": "Щоб видалити обліковий запис, будь ласка, надішліть їх на інший гаманець."
        },
        "confirm": {
            "title": "Ви впевнені, що хочете видалити свій обліковий запис і всі дані з цього додатку?",
            "message": "Ця дія видалить ваш обліковий запис і всі дані з цього додатку та переведе всі ваші TON монети на вказану вами адресу гаманця.\nБудь ласка, уважно перевірте адресу одержувача перед продовженням. Стандартна блокчейн-комісія стягується за цю транзакцію."
        },
        "checkRecipient": "Перевірити одержувача",
        "checkRecipientDescription": "Щоб зробити ваш обліковий запис неактивним, ви повинні перевести всі кошти на інший гаманець (адреса одержувача). Будь ласка, уважно перевірте адресу перед продовженням"
    },
    "logout": {
        "title": "Ви впевнені, що хочете вийти з {{name}}?",
        "logoutDescription": "Доступ до гаманця буде відключено. Ви зберегли свій приватний ключ?"
    },
    "contacts": {
        "title": "Контакти",
        "contact": "Контакт",
        "unknown": "Невідомий",
        "contacts": "Мої контакти",
        "name": "Ім'я",
        "lastName": "Прізвище",
        "company": "Компанія",
        "add": "Додати контакт",
        "edit": "Редагувати",
        "save": "Зберегти",
        "notes": "Примітки",
        "alert": {
            "name": "Некоректне ім'я",
            "nameDescription": "Ім'я контакту не може бути порожнім або довшим за 126 символів",
            "notes": "Некоректне поле",
            "notesDescription": "Поля контакту не можуть бути довшими за 280 символів"
        },
        "delete": "Видалити контакт",
        "empty": "Контактів ще немає",
        "description": "Ви можете додати адресу до своїх контактів, довго натискаючи на будь-яку транзакцію або адресу, або використовуючи кнопку \"Додати\" або зі списку останніх контактів нижче",
        "contactAddress": "Адреса контакту",
        "search": "Ім'я або адреса гаманця",
        "new": "Новий контакт"
    },
    "currency": {
        "USD": "Долар США",
        "EUR": "Євро",
        "RUB": "Російський рубль",
        "GBP": "Британські фунти",
        "CHF": "Швейцарський франк",
        "CNY": "Китайський юань",
        "KRW": "Південнокорейська вона",
        "IDR": "Індонезійська рупія",
        "INR": "Індійська рупія",
        "JPY": "Японська єна"
    },
    "txActions": {
        "addressShare": "Поділитися адресою",
        "addressContact": "Додати адресу до контактів",
        "addressContactEdit": "Редагувати адресу контакту",
        "addressMarkSpam": "Позначити адресу як спам",
        "txShare": "Поділитися транзакцією",
        "txRepeat": "Повторити транзакцію",
        "view": "Переглянути в Tonviewer",
        "share": {
            "address": "TON адреса",
            "transaction": "TON транзакція"
        }
    },
    "hardwareWallet": {
        "ledger": "Ledger",
        "title": "Підключити Ledger",
        "description": "Ваш апаратний гаманець Ledger",
        "installationIOS": "Розблокуйте Ledger, підключіть його до смартфона через Bluetooth і надайте доступ Tonhub.",
        "installationAndroid": "Розблокуйте Ledger, підключіть його до смартфона через Bluetooth або USB-кабель і надайте доступ Tonhub.",
        "installationGuide": "Посібник з підключення TON Ledger",
        "connectionDescriptionAndroid": "Підключіть ваш Ledger через USB або Bluetooth",
        "connectionDescriptionIOS": "Підключіть ваш Ledger через Bluetooth",
        "connectionHIDDescription_1": "1. Увімкніть ваш Ledger і розблокуйте його",
        "connectionHIDDescription_2": "2. Натисніть \"Продовжити\"",
        "openTheAppDescription": "Відкрийте додаток TON на вашому Ledger",
        "unlockLedgerDescription": "Розблокуйте ваш Ledger",
        "chooseAccountDescription": "Виберіть обліковий запис, який хочете використовувати",
        "bluetoothScanDescription_1": "1. Увімкніть ваш Ledger і розблокуйте його",
        "bluetoothScanDescription_2": "2. Переконайтеся, що Bluetooth увімкнено",
        "bluetoothScanDescription_3": "3. Натисніть \"Сканувати\", щоб знайти доступні пристрої, і виберіть відповідний Ledger Nano X",
        "bluetoothScanDescription_3_and": "3. Натисніть \"Сканувати\", щоб знайти доступні пристрої (нам потрібен доступ до даних про місцезнаходження пристрою та дозвіл на пошук найближчих пристроїв)",
        "bluetoothScanDescription_4_and": "4. Потім виберіть відповідний Ledger Nano X",
        "openAppVerifyAddress": "Перевірте адресу облікового запису, який ви вибрали, а потім підтвердіть адресу за допомогою додатка Ledger Ton, коли буде запропоновано",
        "devices": "Ваші пристрої",
        "connection": "Підключення",
        "actions": {
            "connect": "Підключити Ledger",
            "selectAccount": "Вибрати обліковий запис",
            "account": "Обліковий запис #{{account}}",
            "loadAddress": "Перевірити адресу",
            "connectHid": "Підключити Ledger через USB",
            "connectBluetooth": "Підключити Ledger через Bluetooth",
            "scanBluetooth": "Сканувати знову",
            "confirmOnLedger": "Підтвердити на Ledger",
            "sending": "Очікування транзакції",
            "sent": "Транзакція відправлена",
            "mainAddress": "Основна адреса",
            "givePermissions": "Надати дозволи"
        },
        "confirm": {
            "add": "Ви впевнені, що хочете додати цей додаток?",
            "remove": "Ви впевнені, що хочете видалити цей додаток?"
        },
        "errors": {
            "bleTitle": "Помилка Bluetooth",
            "noDevice": "Пристрій не знайдено",
            "appNotOpen": "Додаток Ton не відкрито на Ledger",
            "openApp": "Відкрийте додаток Ton на вашому Ledger",
            "turnOnBluetooth": "Будь ласка, увімкніть Bluetooth і спробуйте знову",
            "lostConnection": "Втрачено з'єднання з Ledger",
            "transactionNotFound": "Транзакція не знайдена",
            "transactionRejected": "Транзакція відхилена",
            "transferFailed": "Передача не вдалася",
            "permissions": "Будь ласка, надайте доступ до Bluetooth і місцезнаходження",
            "unknown": "Невідома помилка",
            "reboot": "Будь ласка, перезавантажте ваш пристрій і спробуйте знову",
            "turnOnLocation": "Будь ласка, увімкніть служби місцезнаходження і спробуйте знову, це необхідно для сканування найближчих пристроїв",
            "locationServicesUnauthorized": "Служби місцезнаходження не авторизовані",
            "bluetoothScanFailed": "Сканування Bluetooth не вдалося",
            "unsafeTransfer": "Будь ласка, дозвольте blind sign у додатку TON Ledger",
            "userCanceled": "Відхилено на Ledger",
            "updateApp": "Будь ласка, оновіть додаток TON у Ledger Live до актуальної версії",
            "permissionsIos": "Будь ласка, дозвольте доступ до Bluetooth"
        },
        "moreAbout": "Детальніше про Ledger",
        "verifyAddress": {
            "title": "Підтвердіть адресу на Ledger",
            "message": "Будь ласка, підтвердіть адресу: {{address}} на вашому пристрої Ledger",
            "action": "Підтвердити",
            "invalidAddressTitle": "Неправильна адреса",
            "invalidAddressMessage": "Ця адреса недійсна. Будь ласка, перевірте адресу та спробуйте ще раз",
            "failed": "Не вдалося підтвердити адресу",
            "failedMessage": "Будь ласка, перепідключіть Ledger і спробуйте ще раз",
            "verifying": "Підтвердження на Ledger"
        }
    },
    "devTools": {
        "switchNetwork": "Мережа",
        "switchNetworkAlertTitle": "Перемикання на мережу {{network}}",
        "switchNetworkAlertMessage": "Ви впевнені, що хочете перемкнути мережі?",
        "switchNetworkAlertAction": "Перемкнути",
        "copySeed": "Скопіювати 24 слова з фрази відновлення",
        "copySeedAlertTitle": "Копіювання 24 слів з фрази відновлення в буфер обміну",
        "copySeedAlertMessage": "УВАГА! Копіювання 24 слів з фрази відновлення в буфер обміну не є безпечним. Продовжуйте на свій страх і ризик.",
        "copySeedAlertAction": "Скопіювати",
        "holdersOfflineApp": "Додаток Holders Offline"
    },
    "wallets": {
        "choose_versions": "Виберіть гаманці для додавання",
        "noVersionTitle": "Виберіть версію",
        "noVersionDescription": "Не вибрана жодна версія гаманця",
        "switchToAlertTitle": "Перемикання на {{wallet}}",
        "switchToAlertMessage": "Ви впевнені, що хочете переключити гаманці?",
        "switchToAlertAction": "Перемкнути",
        "addNewTitle": "Додати гаманець",
        "addNewAlertTitle": "Додавання нового гаманця",
        "addNewAlertMessage": "Ви впевнені, що хочете додати новий гаманець?",
        "addNewAlertAction": "Додати",
        "alreadyExistsAlertTitle": "Гаманець вже існує",
        "alreadyExistsAlertMessage": "Гаманець з цією адресою вже існує",
        "settings": {
            "changeAvatar": "Змінити аватар",
            "selectAvatarTitle": "Зображення",
            "selectColorTitle": "Колір фону"
        }
    },
    "webView": {
        "checkInternetAndReload": "Будь ласка, перевірте інтернет-з'єднання і спробуйте перезавантажити сторінку",
        "contactSupportOrTryToReload": "Зверніться до підтримки або спробуйте перезавантажити сторінку",
        "contactSupport": "Зверніться до підтримки"
    },
    "appAuth": {
        "description": "Щоб продовжити вхід в додаток"
    },
    "screenCapture": {
        "title": "Вау, крутий скріншот, але це небезпечно",
        "description": "Не рекомендується зберігати незашифровані цифрові копії вашої секретної фрази. Приклади включають збереження копій на комп'ютері, в онлайн-акаунтах або шляхом створення скріншотів",
        "action": "Добре, я беру на себе ризик"
    },
    "onboarding": {
        "avatar": "Тут ви можете змінити аватар і ім'я ваших гаманців",
        "wallet": "Тут ви можете додати нові або переключитися між вашими гаманцями",
        "price": "Тут ви можете змінити основну валюту"
    },
    "newAddressFormat": {
        "title": "Формат адреси",
        "fragmentTitle": "Новий тип адрес",
        "learnMore": "Детальніше про нові адреси",
        "shortDescription": "Оновлення адрес зробить блокчейн TON ще більш безпечним і стабільним. Всі активи, відправлені на вашу стару адресу, продовжать надходити на ваш гаманець.",
        "description_0_0": "Нещодавно TON ",
        "description_0_link": "оголосив про це оновлення",
        "description_0_1": " адрес і попросив всі гаманці підтримати його.",
        "title_1": "Чому?",
        "description_1": "Оновлення дозволяє розробникам розрізняти адреси гаманців і контрактів та уникати помилок при відправленні транзакцій.",
        "title_2": "Що вам потрібно зробити?",
        "description_2": "Натисніть кнопку на попередньому екрані та авторизуйте нас для відображення всіх адрес у додатку в новому форматі. Ви зможете повернутися до старого формату в налаштуваннях.",
        "title_3": "Що станеться зі старою адресою?",
        "description_3": "Всі TON, токени, NFT та інші активи, відправлені на вашу стару адресу, продовжать надходити на ваш гаманець.",
        "description_4": "Технічні деталі оновлення можна знайти на",
        "action": "Використовувати {{format}}",
        "oldAddress": "Стара адреса",
        "newAddress": "Нова адреса",
        "bannerTitle": "Оновіть вашу адресу",
        "bannerDescription": "З EQ на UQ"
    },
    "changelly": {
        "title": "Changelly - некстодіальний, миттєвий обмінник криптовалют",
        "description": "Ви збираєтеся використовувати сервіс Changelly, який керується незалежною стороною, не пов'язаною з Tonhub\nДля продовження вам необхідно погодитися з Умовами використання та Політикою конфіденційності",
        "dontShowTitle": "Більше не показувати для Changelly",
        "bannerTitle": "Депозити USDC",
        "bannerDescription": "Доступні Tron, Solana, Ethereum, Polygon!"
    },
    "w5": {
        "banner": {
            "title": "Додати гаманець W5",
            "description": "Переклад USDT без газу"
        },
        "update": {
            "title": "Оновити гаманець до W5",
            "subtitle_1": "Безгазові переклади USDT",
            "description_1": "Вам більше не потрібен TON для відправки USDT. Комісії за транзакції можуть бути покриті з вашого балансу токенів.",
            "subtitle_2": "Економія на комісіях",
            "description_2": "W5 дозволяє збільшити кількість операцій в одній транзакції в 60 разів і значно заощадити на комісіях.",
            "subtitle_3": "Ваша секретна фраза не змінюється",
            "description_3": "Гаманці V4 і W5 мають однакову секретну фразу. Ви завжди можете переключатися між версіями, вибираючи бажану адресу у верхній частині головного екрану.",
            "switch_button": "Переключитися на W5"
        },
        "gaslessInfo": "TON не потрібен для оплати комісії за газ при відправці цього токена. Комісія буде списана безпосередньо з вашого балансу токенів."
    },
    "browser": {
        "listings": {
            "categories": {
                "other": "Інше",
                "exchange": "Обміни",
                "defi": "DeFi",
                "nft": "NFT",
                "games": "Ігри",
                "social": "Соціальні",
                "utils": "Утиліти",
                "services": "Послуги"
            },
            "title": "Для вас"
        },
        "refresh": "Перезавантажити",
        "back": "Назад",
        "forward": "Вперед",
        "share": "Поділитися",
        "search": {
            "placeholder": "Пошук",
            "invalidUrl": "Недійсна URL",
            "urlNotReachable": "URL недоступна",
            "suggestions": {
                "web": "Пошук в {{engine}}",
                "ddg": "DuckDuckGo",
                "google": "Google"
            }
        },
        "alertModal": {
            "message": "Ви збираєтеся відкрити сторонній веб-додаток. Ми не несемо відповідальності за вміст або безпеку сторонніх додатків.",
            "action": "Відкрити"
        }
    },
    "swap": {
        "title": "DeDust.io — AMM DEX на The Open Network",
        "description": "Ви збираєтеся використовувати сервіс Dedust.io, який управляється незалежною стороною, не пов'язаною з Tonhub\nВи повинні погодитися з Умовами використання та Політикою конфіденційності, щоб продовжити",
        "termsAndPrivacy": "Я прочитав і погоджуюся з ",
        "dontShowTitle": "Більше не показувати для DeDust.io"
    },
    "mandatoryAuth": {
        "title": "Перевірте вашу резервну копію",
        "description": "Увімкніть перевірку при відкритті гаманця. Це допоможе зберегти ваші банківські дані в безпеці.",
        "alert": "Запишіть 24 секретні слова в розділі Безпека налаштувань вашого гаманця. Це допоможе вам відновити доступ, якщо ви втратите телефон або забудете пін-код.",
        "confirmDescription": "Я записав 24 секретні слова мого гаманця і зберіг їх у безпечному місці",
        "action": "Увімкнути",
        "settingsDescription": "Запит на аутентифікацію потрібен, оскільки додаток відображає банківські продукти. Чутливі дані будуть приховані, доки ви не увімкнете аутентифікацію"
    },
    "update": {
        "callToAction": "Оновити Tonhub"
    },
    "savings": {
        "ton": "TON ощадний рахунок",
        "usdt": "USDT ощадний рахунок",
        "general": "{{symbol}} ощадний рахунок"
    },
    "spending": {
        "ton": "Рахунок витрат TON",
        "usdt": "Рахунок витрат USDT",
        "general": "Рахунок витрат {{symbol}}"
    },
    "solana": {
        "instructions": {
            "createAssociatedTokenAccount": "Створення пов'язаного облікового запису токена",
            "unknown": "Невідома інструкція",
            "systemTransfer": "Переказ SOL",
            "createAccount": "Створення облікового запису",
            "tokenTransfer": "Переказ токена",
            "depositCard": "Поповнення картки",
            "closeCard": "Закрити картку",
            "updateCardLimits": "Оновити ліміти картки"
        },
        "banner": {
            "title": "Тепер доступні Solana та USDC",
            "description": "Отримайте, зберігайте та відправляйте SOL та USDC"
        }
    },
    "iban": {
        "banner": {
            "title": "Поповнення через IBAN",
            "description": "Отримайте ранній доступ"
        }
    }
};

export default schema;
